def get_header_table(
    name="", number="", age="", card="", room="", weight="", height=""
):
    data = [
        ["ПІБ  {}".format(name), "Категорія"],  # 0
        ["", "Термін"],  # 1
        [
            "Телефон {}".format(number),
            "Вік {}".format(age),
            "Карта {}".format(card),
            "Палата {}".format(room),
        ],  # 2
        [
            "Лікар",
            "Вага {}".format(weight),
            "Ріст {}".format(height),
            "АТ",
            "К",
            "П",
        ],  # 3
        ["Діагноз", "ФОТО"],  # 4
        ["", "Дієта"],  # 5
        ["Супутні: "],  # 6
        [""],  # 7
        ["Скарги"],  # 8
        ["Обстеження:"],  # 9
        ["1-гірко, 2-середнє, 3-добре", "Розклад процедур"],  # 10
        ["1 САН", "", "", "", "Грязьові аплік.", "", ""],  # 11
        ["Теппінг тест", "Осекерит", "", ""],  # 12
        ["3  Колярові картини  Китаока рух %", "Амплипульс", "", ""],  # 13
        [
            "3  (Немає 0-3)",
            "2 ( Повільно 4-6)",
            "1 1(Швидко >6)",
            "Електрофорез",
            "",
            "",
        ],  # 14
        ["4  Тестування м’язів", "Біоптрон", "", ""],  # 15
        ["5 ЕЕГ", "Лазеротерапія", "", ""],  # 16
        ["6  Шкала Тревоги", "Лік. фізкультура", "", ""],  # 17
        [
            "3 Норма (0-7)",
            "2  Гірше(8-10)",
            "1  Погано (11+)",
            "Грязь тампони",
            "",
            "",
        ],  # 18
        ["7 FMS", "Механотерапія", "", ""],  # 19
        ["8 Тест Balans", "Підв.витяг.хребта", "", ""],  # 20
        ["9. Об’єм груди /видох-      / вдох-      /", "магнітотерапія", "", ""],  # 21
        ["5-Гірко  10- Середнє  15-Добре", "світолікування", "", ""],  # 22
        ["Загальне:", "", "", ""],  # 23
    ]
    return data


def get_running_truck_program_table():
    data = [
        [
            "Швидкість",
            "Дистанція",
            "Тривалість",
            "Кроків",
            "До навантаженя",
            "Після навантаження",
        ],  # 0
        [
            "(км/год)",
            "(км)",
            "(хв)",
            "(к-сть)",
            "кисень",
            "пульс",
            "АТ",
            "кисень",
            "пульс",
            "АТ",
            "реституція",
        ],  # 1
        ["", "", "", "", "", "", "", "", "", "", ""],  # 2
        ["", "", "", "", "", "", "", "", "", "", ""],  # 3
        [""],
    ]
    return data


def get_jumping_on_the_spot_program_table():
    data = [
        [
            "Дата",
            "Тривалість",
            "Кількість",
            "До навантаженя",
            "Після навантаження",
        ],  # 0
        [
            "",
            "(хв.)",
            "",
            "кисень",
            "пульс",
            "АТ",
            "кисень",
            "пульс",
            "АТ",
            "реституція",
        ],  # 1
        ["", "", "", "", "", "", "", "", "", ""],  # 2
        [""],  # 3
    ]
    return data


def get_lusher_test_table():
    data = [
        ["1-1", "", "", "", "", "", "", "", ""],  # 0
        ["1-2", "", "", "", "", "", "", "", ""],  # 1
        ["2-1", "", "", "", "", "", "", "", ""],  # 2
        ["2-2", "", "", "", "", "", "", "", ""],  # 3
    ]
    return data


def get_examination_table(
    yawleft="", yawright="", rollleft="", rollright="", pitchdown="", pitchup=""
):
    data = [
        ["Положение:  Лежа на спине"],  # 0
        ["1", "Растяжение мышц под. коленом ", "прав", "", "лев", ""],  # 1
        ["2", "Подьем прямой ноги вверх", "прав", "", "лев", ""],  # 2
        ["3", "Сгибание ноги в колене", "прав", "", "лев", ""],  # 3
        [
            "4",
            "Отведение прямой ноги в сторону/внешнее отведение/",
            "прав",
            "",
            "лев",
            "",
        ],  # 4
        ["5", "Приведение согнутой/ ноги во внутр./наружy", "прав", "", "лев", ""],  # 5
        ["6", "Разведение согнутых ног в стороны", "прав", "", "лев", ""],  # 6
        ["7", "Колений суглоб  /ротация/", "прав", "", "лев", ""],  # 7
        [
            "8",
            "Напряжение в икраножных мышцах внутрен./наружн.",
            "прав",
            "",
            "лев",
            "",
        ],  # 8
        [
            "9",
            "Напряжение в 4-х главой.мышцы бедра/наружное//",
            "прав",
            "",
            "лев",
            "",
        ],  # 9
        [
            "10",
            "Напряжение в фасци мышцы бедра/ боковое//",
            "прав",
            "",
            "лев",
            "",
        ],  # 10
        ["11", "Надавливание в области живота//поясницы", "прав", "", "лев", ""],  # 11
        ["12", "Надавливание. Малая  грудная", "прав", "", "лев", ""],  # 12
        ["13", "Напряжение Большая грудная", "прав", "", "лев", ""],  # 13
        ["14", "Напряжение Живот прямые мышцы.", "прав", "", "лев", ""],  # 14
        ["15", "Напаряжение Бицепс", "прав", "", "лев", ""],  # 15
        ["16", "Напряжение в области Таза", "прав", "", "лев", ""],  # 16
        ["17", "Стопы.  Движение стоп на себя", "прав", "", "лев", ""],  # 17
        [
            "18",
            "Стопы.  Отведение стопы в спокойном состоянии.",
            "прав",
            "",
            "лев",
            "",
        ],  # 18
        ["Положение : Лежа на животе"],  # 19
        ["1", "Сгибание ноги в колене ", "прав", "", "лев", ""],  # 20
        ["2", "Поднятие прямой ноги вверх", "прав", "", "лев", ""],  # 21
        ["3", "Подьем согнутой в колене  ноги вверх ", "прав", "", "лев", ""],  # 22
        [
            "4",
            "Отведение прямой ноги всторону/внешнее отведение/",
            "прав",
            "",
            "лев",
            "",
        ],  # 23
        ["5", "Приведение согнутой  ноги во внутрь/", "прав", "", "лев", ""],  # 24
        ["6", "Развидение согнутых в коленях ног ", "прав", "", "лев", ""],  # 25
        [
            "7",
            "Надавливание на ягодицы /-боль/  Грушевидная м-ца ",
            "прав",
            "",
            "лев",
            "",
        ],  # 26
        ["8", "Надавливание в области груди, лопатки", "прав", "", "лев", ""],  # 27
        ["9", "2-х главая мышца бедра", "прав", "", "лев", ""],  # 28
        ["Корпус"],  # 29
        ["Грудная клетка Напряжение"],  # 30
        ["Грудная клетка"],  # 31
        [
            "Наклон корпуса вперед  Растояние от кончиков пальцев  до пола   __________см"
        ],  # 32
        [
            "Наклон корпуса в сторони .Разнрица в наклоне право/лево            ____________см"
        ],  # 33
        ["Отведение   обеих  рук в сторону и назад:  "],  # 34
        ["Голова"],  # 35
        [
            "№",
            "Действие",
            "α",
            "β",
            "γ",
            "Шкала боли",
            "Характер боли",
            "Динамика боли",
            "Триггерные точки",
        ],  # 36
        ["1", "Поворот вправо", "{}".format(yawright), "", "", "", "", "", ""],  # 37
        ["2", "Поворот влево", "{}".format(yawleft), "", "", "", "", "", ""],  # 38
        ["3", "Наклон вправо", "", "{}".format(rollright), "", "", "", "", ""],  # 39
        ["4", "Наклон вправо", "", "{}".format(rollleft), "", "", "", "", ""],  # 40
        ["5", "Наклон вперед", "", "", "{}".format(pitchup), "", "", "", ""],  # 41
        ["6", "Наклон назад", "", "", "{}".format(pitchdown), "", "", "", ""],  # 42
    ]
    return data
